package aug.laundry.enums.orderStatus;

import aug.laundry.enums.category.Category;
import aug.laundry.enums.zipcode.ZipCode_SEOUL;
import com.fasterxml.jackson.annotation.JsonFormat;
import lombok.Getter;

import java.util.*;
import java.util.concurrent.ConcurrentHashMap;
import java.util.stream.Collectors;

@Getter
public enum routineOrder {

//    중구(Arrays.asList("중앙동", "동광동", "대청동","보수동","부평동","광복동","남포동","영주동")),
//    서구( Arrays.asList("동대신동","서대신동","부민동","아미동","초장동","충무동","남부민동","암남동")),
//    동구(Arrays.asList("초량동","수정동","수정동","좌천동","범일동")),
//    영도구(Arrays.asList("남항동","영선동","신선동","봉래동","청학동","동삼동")),
//    부산진구(Arrays.asList("부전동","연지동","초읍동","양정동","전포동","부암동","당감동","가야동","개금동","범천동")),
//    동래구(Arrays.asList("수민동","복산동","명륜동","온천동","사직동","안락동","명장동")),
//    남구(Arrays.asList("대연동","용호동","용당동","감만동","우암동","문현동")),
//    북구(Arrays.asList("구포동","금곡동","화명동","덕천동","만덕동")),
//    해운대구(Arrays.asList("우제동","중제동","좌제동","송정동","반여동","반송동","재송동")),
//    사하구(Arrays.asList("괴정동","당리동","하단동","신평동","장림동","다대동","구평동","감천동")),
//    금정구(Arrays.asList("서동","금사동","부곡동","장전동","선두구동","청룡노포동","남산동","구서동","금성동")),
//    강서구(Arrays.asList("대저동","강동동","명지동","가락동","녹산동","가덕도동")),
//    연제구(Arrays.asList("거제동","연산동")),
//    수영구(Arrays.asList("남천동","수영동","망미동","광안동","민락동")),
//    사상구(Arrays.asList("삼락동","모라동","덕포동","괘법동","감전동","주례동","학장동","엄궁동")),
//    기장군(Arrays.asList("기장읍","장안읍","정관읍","일광읍","철마면"));

    강남구(Arrays.asList("신사동", "논현동", "압구정동","청담동","삼성동","대치동","역삼동","도곡동","개포동","일원본동","일원동","수서동","세곡동")),
    강동구(Arrays.asList("강일동", "상일동", "명일동","고덕동","암사동","천호동","성내동","길동","둔촌동")),
    강북구(Arrays.asList("삼양동", "미아동", "송중동","송천동","삼각산동","번동","수유동","우이동","인수동")),
    강서구(Arrays.asList("염창동", "등촌동", "화곡본동","우장산동","가양동","발산동","공항동","방화동")),
    관악구(Arrays.asList("은천동", "성현동", "청룡동","보라매동","청림동","행운동","낙성대동","중앙동","인헌동","남현동","서원동","신원동","서림동","난곡동","신사동","신림동","삼성동","조원동","대학동","미성동")),
    광진구(Arrays.asList("중곡동", "능동", "구의동", "광장동", "자양동", "화양동", "군자동")),
    구로구(Arrays.asList("신도림동", "구로동", "가리봉동", "고척동", "개봉동", "오류동", "항동", "수궁동")),
    금천구(Arrays.asList("가산동", "독산동", "시흥동")),
    노원구(Arrays.asList("월계동", "공릉동", "하계동", "중계본동", "상계동")),
    도봉구(Arrays.asList("쌍문동", "방학동", "창동", "고척동", "도봉동")),
    동대문구(Arrays.asList("용신동", "제기동", "전농동", "답십리동", "장안동", "청량리동", "회기동", "휘경동", "이문동")),
    동작구(Arrays.asList("노량진동", "상도동", "흑석동", "사당동", "대방동", "신대방동")),
    마포구(Arrays.asList("아현동", "신공덕동", "공덕동", "도화동", "용강동", "대흥동", "염리동", "신수동", "서강동", "서교동", "합정동", "망원동", "연남동", "성산동", "상암동")),
    서대문구(Arrays.asList("북아현동", "천연동", "충현동", "신촌동", "연희동", "홍제동", "남가좌동", "북가좌동", "홍은동")),
    서초구(Arrays.asList("서초동", "잠원동", "반포본동", "방배본동", "방배동", "양재동", "내곡동")),
    성동구(Arrays.asList("왕십리동", "왕십리도선동", "마장동", "사근동", "행당동", "응봉동", "금호동", "옥수동", "성수1가동", "성수2가동", "송정동", "용답동")),
    성북구(Arrays.asList("성북동", "삼선동", "동선동", "돈암동", "안암동", "보문동", "정릉동", "길음동", "종암동", "월곡동", "장위동", "석관동")),
    송파구(Arrays.asList("풍납동", "거여동", "마천동", "방이동", "오륜동", "오금동", "송파동", "석촌동", "삼전동", "가락본동", "가락동", "문정동", "장지동", "위례동", "잠실본동", "잠실동")),
    양천구(Arrays.asList("목동", "신월동", "신정동")),
    영등포구(Arrays.asList("영등포본동", "영등포동", "여의동", "당산동", "도림동", "문래동", "양평동", "신길동", "신길동", "대림동")),
    용산구(Arrays.asList("후암동", "용산2가동", "남영동", "청파동", "원효로제1동", "원효로제2동", "효창동", "용문동", "용문동", "한강로동", "이촌동", "이태원동", "한남동", "서빙고동", "보광동")),
    은평구(Arrays.asList("녹번동", "불광동", "갈현동", "구산동", "대조동", "응암동", "역촌동", "신사동", "증산동", "수색동", "진관동")),
    종로구(Arrays.asList("청운효자동 ", "사직동", "삼청동", "부암동", "평창동", "무악동", "교남동", "가회동", "종로1가동", "종로2가동", "종로3가동", "종로4가동", "종로5가동", "종로6가동", "이화동", "혜화동", "창신동", "숭인동")),
    중구(Arrays.asList("소공동", "회현동", "명동", "필동", "장충동", "광희동", "을지로동", "신당동", "다산동", "약수동", "청구동", "신당5동", "동화동", "황학동", "중림동")),
    중랑구(Arrays.asList("면목본동", "면목동", "상봉동 ", "중화동 ", "묵동", "망우본동", "망우동", "신내동"));



    private List<String> dongName;

    routineOrder(List dongName) {
        this.dongName = dongName;
    }

    public static List<String> regionList(String region){
        routineOrder order = routineOrder.valueOf(region);
        List<String> dongName = order.getDongName();
        return dongName;
    }
}
